x, y = 37, 58
#x в десятичной и двоичной системе
print('x = ', x, ' x_bin = ', bin(x))
#y в десятичной и двоичной системе
print('y = ', y, ' y_bin = ', bin(y))
#~x в десятичной и двоичной системе
a = ~x
print('~x =', a, ' ~x_bin = ', bin(a))
#x>>3 в десятичной и двоичной системе
b = x >> 3
print('x>>3 =', b, ' (x>>3)_bin = ', bin(b))
#x<<2 в десятичной и двоичной системе
c = x << 2
print('x<<2 =', c, ' (x<<2)_bin = ', bin(c))
#x&y в десятичной и двоичной системе
d = x & y
print('x&y =', d, ' (x&y)_bin = ', bin(d))
#x^y в десятичной и двоичной системе
e = x ^ y
print('x^y =', e, ' (x^y)_bin = ', bin(e))
#x|y в десятичной и двоичной системе
f = x | y
print('x|y =', f, ' (x|y)_bin = ', bin(f))
